carloscn/s32k344_rtd/BaseNXP_TS_T40D34M30I0R0/header/S32M27x_EMIOS.h
#define eMIOS_GFLAG_F18_MASK                     (0x40000U)
#define eMIOS_GFLAG_F18_SHIFT                    (18U)
#define eMIOS_GFLAG_F18_WIDTH                    (1U)
#define eMIOS_GFLAG_F18(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F18_SHIFT)) & eMIOS_GFLAG_F18_MASK)

#define eMIOS_GFLAG_F19_MASK                     (0x80000U)
#define eMIOS_GFLAG_F19_SHIFT                    (19U)
#define eMIOS_GFLAG_F19_WIDTH                    (1U)
#define eMIOS_GFLAG_F19(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F19_SHIFT)) & eMIOS_GFLAG_F19_MASK)

#define eMIOS_GFLAG_F20_MASK                     (0x100000U)
#define eMIOS_GFLAG_F20_SHIFT                    (20U)
#define eMIOS_GFLAG_F20_WIDTH                    (1U)
#define eMIOS_GFLAG_F20(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F20_SHIFT)) & eMIOS_GFLAG_F20_MASK)

#define eMIOS_GFLAG_F21_MASK                     (0x200000U)
#define eMIOS_GFLAG_F21_SHIFT                    (21U)
#define eMIOS_GFLAG_F21_WIDTH                    (1U)
#define eMIOS_GFLAG_F21(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F21_SHIFT)) & eMIOS_GFLAG_F21_MASK)

#define eMIOS_GFLAG_F22_MASK                     (0x400000U)
#define eMIOS_GFLAG_F22_SHIFT                    (22U)
#define eMIOS_GFLAG_F22_WIDTH                    (1U)
#define eMIOS_GFLAG_F22(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F22_SHIFT)) & eMIOS_GFLAG_F22_MASK)

#define eMIOS_GFLAG_F23_MASK                     (0x800000U)
#define eMIOS_GFLAG_F23_SHIFT                    (23U)
#define eMIOS_GFLAG_F23_WIDTH                    (1U)
#define eMIOS_GFLAG_F23(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_GFLAG_F23_SHIFT)) & eMIOS_GFLAG_F23_MASK)
/*! @} */

/*! @name OUDIS - Output Update Disable */
/*! @{ */

#define eMIOS_OUDIS_OU0_MASK                     (0x1U)
#define eMIOS_OUDIS_OU0_SHIFT                    (0U)
#define eMIOS_OUDIS_OU0_WIDTH                    (1U)
#define eMIOS_OUDIS_OU0(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU0_SHIFT)) & eMIOS_OUDIS_OU0_MASK)

#define eMIOS_OUDIS_OU1_MASK                     (0x2U)
#define eMIOS_OUDIS_OU1_SHIFT                    (1U)
#define eMIOS_OUDIS_OU1_WIDTH                    (1U)
#define eMIOS_OUDIS_OU1(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU1_SHIFT)) & eMIOS_OUDIS_OU1_MASK)

#define eMIOS_OUDIS_OU2_MASK                     (0x4U)
#define eMIOS_OUDIS_OU2_SHIFT                    (2U)
#define eMIOS_OUDIS_OU2_WIDTH                    (1U)
#define eMIOS_OUDIS_OU2(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU2_SHIFT)) & eMIOS_OUDIS_OU2_MASK)

#define eMIOS_OUDIS_OU3_MASK                     (0x8U)
#define eMIOS_OUDIS_OU3_SHIFT                    (3U)
#define eMIOS_OUDIS_OU3_WIDTH                    (1U)
#define eMIOS_OUDIS_OU3(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU3_SHIFT)) & eMIOS_OUDIS_OU3_MASK)

#define eMIOS_OUDIS_OU4_MASK                     (0x10U)
#define eMIOS_OUDIS_OU4_SHIFT                    (4U)
#define eMIOS_OUDIS_OU4_WIDTH                    (1U)
#define eMIOS_OUDIS_OU4(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU4_SHIFT)) & eMIOS_OUDIS_OU4_MASK)

#define eMIOS_OUDIS_OU5_MASK                     (0x20U)
#define eMIOS_OUDIS_OU5_SHIFT                    (5U)
#define eMIOS_OUDIS_OU5_WIDTH                    (1U)
#define eMIOS_OUDIS_OU5(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU5_SHIFT)) & eMIOS_OUDIS_OU5_MASK)

#define eMIOS_OUDIS_OU6_MASK                     (0x40U)
#define eMIOS_OUDIS_OU6_SHIFT                    (6U)
#define eMIOS_OUDIS_OU6_WIDTH                    (1U)
#define eMIOS_OUDIS_OU6(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU6_SHIFT)) & eMIOS_OUDIS_OU6_MASK)

#define eMIOS_OUDIS_OU7_MASK                     (0x80U)
#define eMIOS_OUDIS_OU7_SHIFT                    (7U)
#define eMIOS_OUDIS_OU7_WIDTH                    (1U)
#define eMIOS_OUDIS_OU7(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU7_SHIFT)) & eMIOS_OUDIS_OU7_MASK)

#define eMIOS_OUDIS_OU8_MASK                     (0x100U)
#define eMIOS_OUDIS_OU8_SHIFT                    (8U)
#define eMIOS_OUDIS_OU8_WIDTH                    (1U)
#define eMIOS_OUDIS_OU8(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU8_SHIFT)) & eMIOS_OUDIS_OU8_MASK)

#define eMIOS_OUDIS_OU9_MASK                     (0x200U)
#define eMIOS_OUDIS_OU9_SHIFT                    (9U)
#define eMIOS_OUDIS_OU9_WIDTH                    (1U)
#define eMIOS_OUDIS_OU9(x)                       (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU9_SHIFT)) & eMIOS_OUDIS_OU9_MASK)

#define eMIOS_OUDIS_OU10_MASK                    (0x400U)
#define eMIOS_OUDIS_OU10_SHIFT                   (10U)
#define eMIOS_OUDIS_OU10_WIDTH                   (1U)
#define eMIOS_OUDIS_OU10(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU10_SHIFT)) & eMIOS_OUDIS_OU10_MASK)

#define eMIOS_OUDIS_OU11_MASK                    (0x800U)
#define eMIOS_OUDIS_OU11_SHIFT                   (11U)
#define eMIOS_OUDIS_OU11_WIDTH                   (1U)
#define eMIOS_OUDIS_OU11(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU11_SHIFT)) & eMIOS_OUDIS_OU11_MASK)

#define eMIOS_OUDIS_OU12_MASK                    (0x1000U)
#define eMIOS_OUDIS_OU12_SHIFT                   (12U)
#define eMIOS_OUDIS_OU12_WIDTH                   (1U)
#define eMIOS_OUDIS_OU12(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU12_SHIFT)) & eMIOS_OUDIS_OU12_MASK)

#define eMIOS_OUDIS_OU13_MASK                    (0x2000U)
#define eMIOS_OUDIS_OU13_SHIFT                   (13U)
#define eMIOS_OUDIS_OU13_WIDTH                   (1U)
#define eMIOS_OUDIS_OU13(x)                      (((uint32_t)(((uint32_t)(x)) << eMIOS_OUDIS_OU13_SHIFT)) & eMIOS_OUDIS_OU13_MASK)

